spec/cassettes/payzen_get_order_1.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.secure.osb.pf/api-payment/V4/Charge/CreatePaymentOrder
    body:
      encoding: UTF-8
      string: '{"amount":10000,"currency":"XPF","channelOptions":{"channelType":"URL"},"orderId":"my-reference"}'
    headers:
      User-Agent:
      - Typhoeus - https://github.com/typhoeus/typhoeus
      Authorization:
      - Basic NTg3Mzk5MzM6dGVzdHBhc3N3b3JkX0NHdnBNOEFyRDhMMnNlaFBPS2FyVkNjVWFGd0p4RzBwUVE3VkxtS3hNOEc4bg==
      Content-Type:
      - application/json
      Expect:
      - ''
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 22 Jun 2022 19:28:08 GMT
      Server:
      - Apache
      X-Powered-By:
      - Undertow/1
      Set-Cookie:
      - JSESSIONID=zBLHLts0AWElm9C6Ldi2MTJ0VVmjGqUrorjFIXej.vadapi01-tls-prod-fr-lyra;
        path=/api-payment
      Content-Length:
      - '1915'
      Vary:
      - Accept-Encoding,User-Agent
      Timing-Allow-Origin:
      - "*"
      Content-Type:
      - application/json;charset=utf-8
    body:
      encoding: ASCII-8BIT
      string: '{"webService":"Charge/CreatePaymentOrder","version":"V4","applicationVersion":"5.37.0","status":"SUCCESS","answer":{"paymentOrderId":"67c300630c1e4fa1a578470275353121","paymentURL":"https://secure.osb.pf/t/3higym7t","paymentOrderStatus":"RUNNING","creationDate":"2022-06-22T19:28:08+00:00","updateDate":null,"amount":10000,"currency":"XPF","locale":"fr_FR","strongAuthentication":"AUTO","orderId":"my-reference","channelDetails":{"channelType":"URL","mailDetails":null,"smsDetails":null,"whatsAppDetails":null,"ivrDetails":null,"_type":"V4/ChannelDetails"},"paymentReceiptEmail":null,"taxRate":null,"taxAmount":null,"expirationDate":"2022-06-23T09:59:59+00:00","transactionDetails":{"cardDetails":{"manualValidation":"NO","captureDelay":0,"_type":"V4/CardDetails"},"_type":"V4/PaymentOrderTransactionDetails"},"dataCollectionForm":false,"allowDCFAmountUpdate":"NONE","merchantComment":null,"message":"Je
        règle %amount% par paiement sécurisé avant le %end_date% (si le lien ne fonctionne
        pas, copier l''URL : %url% ).","description":null,"formAction":"PAYMENT","paymentMethodToken":null,"metadata":{},"customer":{"billingDetails":null,"email":null,"reference":null,"shippingDetails":null,"extraDetails":{"browserAccept":null,"fingerPrintId":null,"ipAddress":null,"browserUserAgent":null,"_type":"V4/Customer/ExtraDetails"},"shoppingCart":null,"_type":"V4/Customer/Customer"},"acquirerTransientData":{},"paymentMethods":[],"subMerchantDetails":{"companyType":null,"legalNumber":null,"name":null,"url":null,"phoneNumber":null,"address1":null,"address2":null,"zip":null,"city":null,"country":null,"mcc":null,"mid":null,"softDescriptor":null,"_type":"V4/SubMerchantDetails"},"_type":"V4/PaymentOrder"},"ticket":"5440d4c58cce43bf9fd691f504f434d3","serverDate":"2022-06-22T19:28:08+00:00","applicationProvider":"OSB","metadata":null,"mode":"TEST","serverUrl":"https://api.secure.osb.pf","_type":"V4/WebService/Response"}'
  recorded_at: Wed, 22 Jun 2022 19:28:09 GMT
- request:
    method: post
    uri: https://api.secure.osb.pf/api-payment/V4/Charge/PaymentOrder/Get
    body:
      encoding: UTF-8
      string: '{"paymentOrderId":"67c300630c1e4fa1a578470275353121"}'
    headers:
      User-Agent:
      - Typhoeus - https://github.com/typhoeus/typhoeus
      Authorization:
      - Basic NTg3Mzk5MzM6dGVzdHBhc3N3b3JkX0NHdnBNOEFyRDhMMnNlaFBPS2FyVkNjVWFGd0p4RzBwUVE3VkxtS3hNOEc4bg==
      Content-Type:
      - application/json
      Expect:
      - ''
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 22 Jun 2022 19:28:09 GMT
      Server:
      - Apache
      X-Powered-By:
      - Undertow/1
      Set-Cookie:
      - JSESSIONID=acP--aDLW1JaX78HbKWIDykS_7DzlbVJP78uyvZ4.vadapi01-tls-prod-fr-lyra;
        path=/api-payment
      Content-Length:
      - '1913'
      Vary:
      - Accept-Encoding,User-Agent
      Timing-Allow-Origin:
      - "*"
      Content-Type:
      - application/json;charset=utf-8
    body:
      encoding: ASCII-8BIT
      string: '{"webService":"Charge/PaymentOrder/Get","version":"V4","applicationVersion":"5.37.0","status":"SUCCESS","answer":{"paymentOrderId":"67c300630c1e4fa1a578470275353121","paymentURL":"https://secure.osb.pf/t/3higym7t","paymentOrderStatus":"RUNNING","creationDate":"2022-06-22T19:28:08+00:00","updateDate":null,"amount":10000,"currency":"XPF","locale":"fr_FR","strongAuthentication":"AUTO","orderId":"my-reference","channelDetails":{"channelType":"URL","mailDetails":null,"smsDetails":null,"whatsAppDetails":null,"ivrDetails":null,"_type":"V4/ChannelDetails"},"paymentReceiptEmail":null,"taxRate":null,"taxAmount":null,"expirationDate":"2022-06-23T09:59:59+00:00","transactionDetails":{"cardDetails":{"manualValidation":"NO","captureDelay":0,"_type":"V4/CardDetails"},"_type":"V4/PaymentOrderTransactionDetails"},"dataCollectionForm":false,"allowDCFAmountUpdate":"NONE","merchantComment":null,"message":"Je
        règle %amount% par paiement sécurisé avant le %end_date% (si le lien ne fonctionne
        pas, copier l''URL : %url% ).","description":null,"formAction":"PAYMENT","paymentMethodToken":null,"metadata":{},"customer":{"billingDetails":null,"email":null,"reference":null,"shippingDetails":null,"extraDetails":{"browserAccept":null,"fingerPrintId":null,"ipAddress":null,"browserUserAgent":null,"_type":"V4/Customer/ExtraDetails"},"shoppingCart":null,"_type":"V4/Customer/Customer"},"acquirerTransientData":{},"paymentMethods":[],"subMerchantDetails":{"companyType":null,"legalNumber":null,"name":null,"url":null,"phoneNumber":null,"address1":null,"address2":null,"zip":null,"city":null,"country":null,"mcc":null,"mid":null,"softDescriptor":null,"_type":"V4/SubMerchantDetails"},"_type":"V4/PaymentOrder"},"ticket":"8e36e4f9eec5404da2810debf6fc223a","serverDate":"2022-06-22T19:28:09+00:00","applicationProvider":"OSB","metadata":null,"mode":"TEST","serverUrl":"https://api.secure.osb.pf","_type":"V4/WebService/Response"}'
  recorded_at: Wed, 22 Jun 2022 19:28:09 GMT
recorded_with: VCR 6.1.0
